app/views/api/courses/show.json.jbuilder

SELECT "tags".* FROM "tags" INNER JOIN "course_tags" ON "tags"."id" = "course_tags"."tag_id" WHERE "course_tags"."course_id" = $1  [["course_id", 1]]
---

if @course.tags.length != 0