app/controllers/api/courses_controller.rb

    def create
        @course = Course.new(course_params)
        if @course.save
            if !Tag.pluck(:tag_name).any?{|tag_name| tag_name == tag_params[:tag_1]}
                tag1 = Tag.create!(tag_name: tag_params[:tag_1])
                CourseTag.create!(course_id: @course.id, tag_id: tag1.id)
            else
                CourseTag.create!(course_id: @course.id, tag_id: Tag.find_by(tag_name: tag_params[:tag_1]).id)
            end
            if !Tag.pluck(:tag_name).any?{|tag_name| tag_name == tag_params[:tag_2]}
                tag2 = Tag.create!(tag_name: tag_params[:tag_2])
                CourseTag.create!(course_id: @course.id, tag_id: tag2.id)
            else
                CourseTag.create!(course_id: @course.id, tag_id: Tag.find_by(tag_name: tag_params[:tag_2]).id)
---
INSERT INTO "courses" ("course_name", "description", "course_type", "image_url", "mentor_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["course_name", "vue12"], ["description", "best vue12"], ["course_type", "Frontend"], ["image_url", "123123"], ["mentor_id", 4]]
SELECT  1 AS one FROM "tags" WHERE "tags"."tag_name" = $1 LIMIT $2  [["tag_name", "hahahahaha"], ["LIMIT", 1]]
SELECT "tags"."tag_name" FROM "tags"
INSERT INTO "tags" ("tag_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["tag_name", "hahahahaha"], ["created_at", "2021-04-07 06:57:33.541061"], ["updated_at", "2021-04-07 06:57:33.541061"]]
INSERT INTO "course_tags" ("course_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["course_id", 13], ["tag_id", 8], ["created_at", "2021-04-07 06:57:33.568062"], ["updated_at", "2021-04-07 06:57:33.568062"]]
INSERT INTO "course_tags" ("course_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["course_id", 27], ["tag_id", 16], ["created_at", "2021-04-07 18:28:37.891105"], ["updated_at", "2021-04-07 18:28:37.891105"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."tag_name" = $1 LIMIT $2  [["tag_name", "big "], ["LIMIT", 1]]
SELECT  1 AS one FROM "tags" WHERE "tags"."tag_name" = $1 LIMIT $2  [["tag_name", "data"], ["LIMIT", 1]]
INSERT INTO "tags" ("tag_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["tag_name", "data"], ["created_at", "2021-04-07 18:23:10.826804"], ["updated_at", "2021-04-07 18:23:10.826804"]]
INSERT INTO "course_tags" ("course_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["course_id", 26], ["tag_id", 17], ["created_at", "2021-04-07 18:23:10.832588"], ["updated_at", "2021-04-07 18:23:10.832588"]]
INSERT INTO "course_tags" ("course_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["course_id", 27], ["tag_id", 17], ["created_at", "2021-04-07 18:28:37.909515"], ["updated_at", "2021-04-07 18:28:37.909515"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."tag_name" = $1 LIMIT $2  [["tag_name", "data"], ["LIMIT", 1]]

    def update
        @course = Course.find(params[:id])
        if @course.update_attributes(course_params)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
UPDATE "courses" SET "course_name" = $1, "description" = $2 WHERE "courses"."id" = $3  [["course_name", "ruby on rails"], ["description", "best ror"], ["id", 3]]

    def destroy
        @course = Course.find(params[:id])
        @course.destroy
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 27]]