app/controllers/api/requests_controller.rb

SELECT "requests".* FROM "requests"
---
    def index
        @requests = Request.all

INSERT INTO "requests" ("course_id", "mentee_id", "start_time", "end_time", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @request = Request.new(request_params)
        if @request.save

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "requests" SET "status" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2021-04-09 00:52:59.341730"], ["id", 2]]
---
    def update
        @request = Request.find(params[:id])
        if @request.update_attributes(request_params)