app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "user2.5"], ["updated_at", "2021-04-07 07:09:33.360372"], ["id", 3]]
---
    def update
        @user = User.find(params[:id])

        if @user.update_attributes(user_params)