app/views/api/users/_user.json.jbuilder


if user.received_requests.length != 0
---
SELECT "requests".* FROM "requests"