app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Yn8IbR6lHn3pzZ3ErH9XGg=="], ["updated_at", "2021-04-06 03:45:33.153868"], ["id", 7]]
---
    def reset_session_token!
        self.session_token = SecureRandom.base64
        self.save